
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Automation
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Automation.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУстанавливаюВБазуРасширениеИзФайла(Парам01)","ЯУстанавливаюВБазуРасширениеИзФайла","И я устанавливаю в базу расширение из файла ""$КаталогПроекта$\Features\Features_IRP\Additional\IRP_TestExtension.cfe""","","");

	Возврат ВсеТесты;
КонецФункции
	
// Делает отключение модуля
Процедура ОтключениеМодуля() Экспорт
	
	Ванесса = Неопределено;
	Контекст = Неопределено;
	КонтекстСохраняемый = Неопределено;
	
КонецПроцедуры
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Функция выполняется перед началом каждого сценария
Функция ПередНачаломСценария() Экспорт
	
КонецФункции

&НаКлиенте
// Функция выполняется перед окончанием каждого сценария
Функция ПередОкончаниемСценария() Экспорт
	
КонецФункции



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И я устанавливаю в базу расширение из файла "$КаталогПроекта$\Features\Features_IRP\Additional\IRP_TestExtension.cfe"
//@ЯУстанавливаюВБазуРасширениеИзФайла(Парам01)
Функция ЯУстанавливаюВБазуРасширениеИзФайла(Парам01) Экспорт
		
	ЯУстанавливаюВБазуРасширениеИзФайлаНаСервере(Парам01);
	
КонецФункции    

&НаСервере
//И я устанавливаю в базу расширение из файла "ПутьКФайлу"
//@ЯУстанавливаюВБазуРасширениеИзФайла(Парам01)
Функция ЯУстанавливаюВБазуРасширениеИзФайлаНаСервере(Парам01) Экспорт 
	
	ДанныеРасширение = Новый ДвоичныеДанные(Парам01);
	Расширение = РасширенияКонфигурации.Создать();
	Расширение.Записать(ДанныеРасширение);    
	
КонецФункции


