
Процедура ДействияФормыОтображениеНастроек(Кнопка)
	
	//	Test commit GIT
	
	Кнопка.Пометка = Не Кнопка.Пометка;
    НастроитьСвертываемостьПанелиНастроек(Кнопка.Пометка);
		
КонецПроцедуры

Процедура НастроитьСвертываемостьПанелиНастроек(Пометка)

	Если Пометка Тогда
		ЭлементыФормы.ПанельПользователя.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
		ЭлементыФормы.Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭлементыФормы.ПанельПользователя, ГраницаЭлементаУправления.Лево);
		ЭлементыФормы.ПанельПользователя.Свертка = РежимСверткиЭлементаУправления.Право;
		ЭлементыФормы.Разделитель.Свертка        = РежимСверткиЭлементаУправления.Право;
		
		ЭлементыФормы.СервиснаяПанель.Кнопки.ПанельПользователя.Текст = "Отобразить настройки";
	Иначе
		ЭлементыФормы.ПанельПользователя.Свертка = РежимСверткиЭлементаУправления.Нет;
		ЭлементыФормы.Разделитель.Свертка        = РежимСверткиЭлементаУправления.Нет;
		
		ЭлементыФормы.Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭлементыФормы.СервиснаяПанель, ГраницаЭлементаУправления.Право);
		ЭлементыФормы.ПанельПользователя.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель, ГраницаЭлементаУправления.Право);
		
		ЭлементыФормы.СервиснаяПанель.Кнопки.ПанельПользователя.Текст = "Скрыть настройки";
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыбПериодНажатие(Элемент)
	
	НастройкаПериода = Новый НастройкаПериода;
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
КонецПроцедуры

