#language: ru

@tree

Функционал: Финальное практическое задание

Как Пользователь я хочу выполнить финальное задание

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка возможности добавления файла картинки в справочник Товары

	И Добавления файла картинки в справочник Товары
	
Сценарий: Проверка открытия и формирования отчета Остатки товаров

	И Тестирование формирования отчета Остатки товаров

Сценарий: Проверка работоспособности документа Расход товара после доработки

	И Проверка работоспособности документа Расход товаров