#language: ru

@tree
@ДвиженияДокументов

Функционал: проверка движения документа поступление товаров

Как Тестировщик я хочу
проверить движения документа Поступления товаров
чтобы убедиться, что документ делает движения по нужным регистрам.

Контекст:
	И Я открыл новый сеанс TestClient или подключил уже существующий
	
Сценарий: _0501 подготовительный сценарий (движения документа Поступление товаров)
	Когда Экспорт основных данных
	Когда Загрузка документа Поступление товаров и услуг
	И я выполняю код встроенного языка на сервере
		|'Документы.PurchaseInvoice.НайтиПоНомеру(1001).ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение)'|

Сценарий: _0502 Проверка движений документа ПОступление товаров по регистру R1001 Закупки
	Дано Я открываю навигационную ссылку "e1cib/list/Document.PurchaseInvoice"
	И в таблице "List" я перехожу к строке
			| 'Номер' |
			| '1 001' |
	И я нажимаю на кнопку с именем 'FormReportDocumentRegistrationsReportRegistrationsReport'
	Тогда открылось окно 'Движения документа'
	И из выпадающего списка с именем "FilterRegister" я выбираю точное значение 'R1001 Закупки'
	И я нажимаю на кнопку с именем 'GenerateReport'
	Тогда табличный документ "ResultTable" равен:
		| 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | ''                    | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | ''                  |
		| 'Движения документа по регистрам'                          | ''                    | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | ''                  |
		| 'Регистр  "R1001 Закупки"'                                 | ''                    | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | ''                  |
		| ''                                                         | 'Period'              | 'Resources'  | ''      | ''                  | ''             | 'Dimensions'             | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | 'Attributes'        |
		| ''                                                         | ''                    | 'Количество' | 'Сумма' | 'Сумма без налогов' | 'Сумма скидки' | 'Организация'            | 'Структурное подразделение' | 'Вид мультивалютной аналитики' | 'Валюта' | 'Инвойс'                                                   | 'Характеристика'          | 'Ключ строки'                          | 'Отложенный расчет' |
		| ''                                                         | '23.01.2022 16:03:33' | '1'          | ''      | ''                  | ''             | 'Собственная компания 1' | ''                          | 'В валюте бюджетирования'      | 'EUR'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Услуга'                  | '45b8db83-fa24-4bc9-b4bb-fc01e24c51fa' | 'Да'                |
		| ''                                                         | '23.01.2022 16:03:33' | '1'          | '171,8' | '143,17'            | ''             | 'Собственная компания 1' | ''                          | 'В локальной валюте страны'    | 'EUR'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Услуга'                  | '45b8db83-fa24-4bc9-b4bb-fc01e24c51fa' | 'Нет'               |
		| ''                                                         | '23.01.2022 16:03:33' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'ru наименование не заполнено' | 'USD'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Услуга'                  | '45b8db83-fa24-4bc9-b4bb-fc01e24c51fa' | 'Нет'               |
		| ''                                                         | '23.01.2022 16:03:33' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'В валюте отчетности'          | 'USD'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Услуга'                  | '45b8db83-fa24-4bc9-b4bb-fc01e24c51fa' | 'Нет'               |
		| ''                                                         | '23.01.2022 16:03:33' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'Валюта соглашения, USD'       | 'USD'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Услуга'                  | '45b8db83-fa24-4bc9-b4bb-fc01e24c51fa' | 'Нет'               |
		| ''                                                         | '23.01.2022 16:03:33' | '2'          | ''      | ''                  | ''             | 'Собственная компания 1' | ''                          | 'В валюте бюджетирования'      | 'EUR'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Товар без характеристик' | '4d06f4db-f5fa-4254-b676-57f6560e4fc9' | 'Да'                |
		| ''                                                         | '23.01.2022 16:03:33' | '2'          | '171,8' | '143,17'            | ''             | 'Собственная компания 1' | ''                          | 'В локальной валюте страны'    | 'EUR'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Товар без характеристик' | '4d06f4db-f5fa-4254-b676-57f6560e4fc9' | 'Нет'               |
		| ''                                                         | '23.01.2022 16:03:33' | '2'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'ru наименование не заполнено' | 'USD'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Товар без характеристик' | '4d06f4db-f5fa-4254-b676-57f6560e4fc9' | 'Нет'               |
		| ''                                                         | '23.01.2022 16:03:33' | '2'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'В валюте отчетности'          | 'USD'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Товар без характеристик' | '4d06f4db-f5fa-4254-b676-57f6560e4fc9' | 'Нет'               |
		| ''                                                         | '23.01.2022 16:03:33' | '2'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'Валюта соглашения, USD'       | 'USD'    | 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | 'Товар без характеристик' | '4d06f4db-f5fa-4254-b676-57f6560e4fc9' | 'Нет'               |
	И я закрываю все окна клиентского приложения
	
	Сценарий: _0503 Проверка движений документа ПОступление товаров по регистру R1021 Взаиморасчеты с поставщиками
		Дано Я открываю навигационную ссылку "e1cib/list/Document.PurchaseInvoice"
		И в таблице "List" я перехожу к строке
				| 'Номер' |
				| '1 001' |
		И я нажимаю на кнопку с именем 'FormReportDocumentRegistrationsReportRegistrationsReport'
		Тогда открылось окно 'Движения документа'
		И из выпадающего списка с именем "FilterRegister" я выбираю точное значение 'R1021 Взаиморасчеты с поставщиками'
		И я нажимаю на кнопку с именем 'GenerateReport'		
		Тогда табличный документ "ResultTable" равен:
			| 'Поступление товаров и услуг 1 001 от 23.01.2022 16:03:33' | ''            | ''                    | ''          | ''                       | ''                          | ''                             | ''       | ''            | ''            | ''                           | ''                   | ''                  | ''                             |
			| 'Движения документа по регистрам'                          | ''            | ''                    | ''          | ''                       | ''                          | ''                             | ''       | ''            | ''            | ''                           | ''                   | ''                  | ''                             |
			| 'Регистр  "R1021 Взаиморасчеты с поставщиками"'            | ''            | ''                    | ''          | ''                       | ''                          | ''                             | ''       | ''            | ''            | ''                           | ''                   | ''                  | ''                             |
			| ''                                                         | 'Record type' | 'Period'              | 'Resources' | 'Dimensions'             | ''                          | ''                             | ''       | ''            | ''            | ''                           | ''                   | 'Attributes'        | ''                             |
			| ''                                                         | ''            | ''                    | 'Сумма'     | 'Организация'            | 'Структурное подразделение' | 'Вид мультивалютной аналитики' | 'Валюта' | 'Контрагент'  | 'Партнер'     | 'Соглашение'                 | 'Документ основание' | 'Отложенный расчет' | 'Закрытие авансов поставщиков' |
			| ''                                                         | 'Приход'      | '23.01.2022 16:03:33' | ''          | 'Собственная компания 1' | ''                          | 'В валюте бюджетирования'      | 'EUR'    | 'Поставщик 2' | 'Поставщик 2' | 'Соглашение с поставщиком 2' | ''                   | 'Да'                | ''                             |
			| ''                                                         | 'Приход'      | '23.01.2022 16:03:33' | '343,6'     | 'Собственная компания 1' | ''                          | 'В локальной валюте страны'    | 'EUR'    | 'Поставщик 2' | 'Поставщик 2' | 'Соглашение с поставщиком 2' | ''                   | 'Нет'               | ''                             |
			| ''                                                         | 'Приход'      | '23.01.2022 16:03:33' | '400'       | 'Собственная компания 1' | ''                          | 'ru наименование не заполнено' | 'USD'    | 'Поставщик 2' | 'Поставщик 2' | 'Соглашение с поставщиком 2' | ''                   | 'Нет'               | ''                             |
			| ''                                                         | 'Приход'      | '23.01.2022 16:03:33' | '400'       | 'Собственная компания 1' | ''                          | 'В валюте отчетности'          | 'USD'    | 'Поставщик 2' | 'Поставщик 2' | 'Соглашение с поставщиком 2' | ''                   | 'Нет'               | ''                             |
			| ''                                                         | 'Приход'      | '23.01.2022 16:03:33' | '400'       | 'Собственная компания 1' | ''                          | 'Валюта соглашения, USD'       | 'USD'    | 'Поставщик 2' | 'Поставщик 2' | 'Соглашение с поставщиком 2' | ''                   | 'Нет'               | ''                             |
		И я закрываю все окна клиентского приложения
				